'''
Дан произвольный список из 5 элементов: 
     - Поменять местами 1ый и последний элемент
     - удалить и вывести на печать третий элемент
'''

list_1 = [20, 21, 22, 23]
list_1[0], list_1[-1] = list_1[-1], list_1[0]
print(list_1)
# >>>> [23, 21, 22, 20]

list_1.remove(23)
print(list_1)
# >>>> [21, 22, 20]